const respuestas = {
    //Первая строка (а-и // 1-10)
    1:{1:"а",2:[1,0,0,0,0,0]},
    2:{1:"б",2:[1,1,0,0,0,0]},
    3:{1:"в",2:[0,1,0,1,1,1]},
    4:{1:"г",2:[1,1,0,1,1,0]},
    5:{1:"д",2:[1,0,0,1,1,0]},
    6:{1:"е",2:[1,0,0,0,1,0]},
    7:{1:"ё",2:[1,0,0,0,0,1]},
    8:{1:"ж",2:[0,1,0,1,1,0]},
    9:{1:"з",2:[1,0,1,0,1,1]},
    10:{1:"и",2:[0,1,0,1,0,0]},

    //Второй ряд (й-т//11-20)
    11:{1:"й",2:[1,1,1,1,0,1]},
    12:{1:"к",2:[1,0,1,0,0,0]},
    13:{1:"л",2:[1,1,1,0,0,0]},
    14:{1:"м",2:[1,0,1,1,0,0]},
    15:{1:"н",2:[1,0,1,1,1,0]},
    16:{1:"о",2:[1,0,1,0,1,0]},
    17:{1:"п",2:[1,1,1,1,0,0]},
    18:{1:"р",2:[1,1,1,0,1,0]},
    19:{1:"с",2:[0,1,1,1,0,0]},
    20:{1:"т",2:[0,1,1,1,1,0]},

    //Третий ряд (у-ь//21-30)
    21:{1:"у",2:[1,0,1,0,0,1]},
    22:{1:"ф",2:[1,1,0,1,0,0]},
    23:{1:"х",2:[1,1,0,0,1,0]},
    24:{1:"ц",2:[1,0,0,1,0,0]},
    25:{1:"ч",2:[1,1,1,1,1,0]},
    26:{1:"ш",2:[1,0,0,0,1,1]},
    27:{1:"щ",2:[1,0,1,1,0,1]},
    28:{1:"ъ",2:[1,1,1,1,0,1]},
    29:{1:"ы",2:[0,1,1,1,0,1]},
    30:{1:"ь",2:[0,1,1,1,1,1]},	
    //Четвертый ряд (щ-я//31-33)
    31:{1:"э",2:[0,1,0,1,0,1]},
    32:{1:"ю",2:[1,1,0,0,1,1]},
    33:{1:"я",2:[1,1,0,1,0,1]},	
    //Пунктуация (34-45)
    34:{1:".",2:[0,1,0,0,1,1]},
    35:{1:"!",2:[0,1,1,0,1,0]},
    36:{1:"-",2:[0,0,1,0,0,1]},
    37:{1:"«",2:[0,1,1,0,0,1]},
    38:{1:"»",2:[0,0,1,0,1,1]},
    39:{1:"(",2:[1,1,0,0,0,1]},
    40:{1:")",2:[0,0,1,1,1,0]},
    41:{1:",",2:[0,1,0,0,0,0]},
    42:{1:"?",2:[0,1,0,0,0,1]},
    43:{1:"*",2:[0,0,1,0,1,0]},
    44:{1:"@",2:[0,0,0,0,1,0]},
    45:{1:"|",2:[0,0,0,1,1,1]},

    //Числа (46-55)
    46:{1:"1",2:[1,0,0,0,0,0]},
    47:{1:"2",2:[1,1,0,0,0,0]},
    48:{1:"3",2:[1,0,0,1,0,0]},
    49:{1:"4",2:[1,0,0,1,1,0]},
    50:{1:"5",2:[1,0,0,0,1,0]},
    51:{1:"6",2:[1,1,0,1,0,0]},
    52:{1:"7",2:[1,1,0,1,1,0]},
    53:{1:"8",2:[1,1,0,0,1,0]},
    54:{1:"9",2:[0,1,0,1,0,0]},
    55:{1:"0",2:[0,1,0,1,1,0]}

    // Математические знаки
    56:{1:"+",2:[0,1,1,0,1,0]},
    57:{1:"-",2:[0,0,1,0,0,1]},
    58:{1:"x",2:[0,1,1,0,0,1]},
    59:{1:"=",2:[0,1,1,0,1,1]},
    60:{1:"/",2:[0,1,0,0,1,1]}
}
var cajetines = {  //Список, который изменяют флажки
    1:[0,0,0,0,0,0], 2:[0,0,0,0,0,0], 3:[0,0,0,0,0,0], 4:[0,0,0,0,0,0],
    5:[0,0,0,0,0,0], 6:[0,0,0,0,0,0], 7:[0,0,0,0,0,0], 8:[0,0,0,0,0,0],
    9:[0,0,0,0,0,0],10:[0,0,0,0,0,0],11:[0,0,0,0,0,0],12:[0,0,0,0,0,0],
   13:[0,0,0,0,0,0],14:[0,0,0,0,0,0],15:[0,0,0,0,0,0],16:[0,0,0,0,0,0],
   17:[0,0,0,0,0,0],18:[0,0,0,0,0,0],19:[0,0,0,0,0,0],20:[0,0,0,0,0,0],
   21:[0,0,0,0,0,0],22:[0,0,0,0,0,0],23:[0,0,0,0,0,0],24:[0,0,0,0,0,0],
   25:[0,0,0,0,0,0],26:[0,0,0,0,0,0],27:[0,0,0,0,0,0],28:[0,0,0,0,0,0]
}
function enviar() {
    var mayus = false;
    var numeri = false;
    var outputregleta = document.getElementById("outputregleta28");

    for (var cajetin=1; cajetin<29; cajetin++) {
        //Для каждого box
        if (JSON.stringify(cajetines[cajetin])==="[0,0,0,0,0,0]") { // Пустой блок знака = пробел
            outputregleta.value += "\ ";
            mayus = false;
            numeri = false;
            continue;
        } else if (JSON.stringify(cajetines[cajetin])==="[0,0,1,1,1,1]") { // Цифра
            numeri = true;
            mayus = false;
            continue;
        } else if (JSON.stringify(cajetines[cajetin])==="[0,0,0,1,0,1]") { //изменение
            mayus = true;
            numeri = false;
            continue;
        } 
        // Циклы последних вариантов для повышения эффективности
         else if (numeri) {
            for (respuesta=42; respuesta<59; respuesta++) {
                if(JSON.stringify(respuestas[respuesta][2])===JSON.stringify(cajetines[cajetin])) {
                    outputregleta.value += respuestas[respuesta][1];
                }
            }
        } else if (mayus) {
            for (respuesta=1; respuesta<34; respuesta++) {
                if(JSON.stringify(respuestas[respuesta][2])===JSON.stringify(cajetines[cajetin])) {
                    var str = respuestas[respuesta][1];
                    outputregleta.value += str.toUpperCase();
                    mayus = false;
                }
            }
        } else {
            for (respuesta=1; respuesta<44; respuesta++) {
                if(JSON.stringify(respuestas[respuesta][2])===JSON.stringify(cajetines[cajetin])) {
                    outputregleta.value += respuestas[respuesta][1];
                }
            }
        }
    }
    outputregleta.value += "\n";
    document.getElementById("mensaje").innerHTML = "";
}
function cb(cajetin, punto) {
    //Каждое действие флажка изменяет список «полей».
    if (cajetines[cajetin][punto - 1] === 0) {
        cajetines[cajetin][punto - 1] = 1;
    } else if (cajetines[cajetin][punto - 1] === 1) {
        cajetines[cajetin][punto - 1] = 0;
    }
}
function desmarcar() {
 // Снимите все галочки и сбросьте список «полей»
    var regletaInput = document.getElementById('regletaInput28');
    var puntos = regletaInput.getElementsByTagName('input');
    for (var i=0; i<puntos.length; i++) {
        puntos[i].checked = false;
    }
    cajetines = {
        1:[0,0,0,0,0,0], 2:[0,0,0,0,0,0], 3:[0,0,0,0,0,0], 4:[0,0,0,0,0,0],
        5:[0,0,0,0,0,0], 6:[0,0,0,0,0,0], 7:[0,0,0,0,0,0], 8:[0,0,0,0,0,0],
        9:[0,0,0,0,0,0],10:[0,0,0,0,0,0],11:[0,0,0,0,0,0],12:[0,0,0,0,0,0],
       13:[0,0,0,0,0,0],14:[0,0,0,0,0,0],15:[0,0,0,0,0,0],16:[0,0,0,0,0,0],
       17:[0,0,0,0,0,0],18:[0,0,0,0,0,0],19:[0,0,0,0,0,0],20:[0,0,0,0,0,0],
       21:[0,0,0,0,0,0],22:[0,0,0,0,0,0],23:[0,0,0,0,0,0],24:[0,0,0,0,0,0],
       25:[0,0,0,0,0,0],26:[0,0,0,0,0,0],27:[0,0,0,0,0,0],28:[0,0,0,0,0,0]
    }
}
function limpiar() {
    document.getElementById("outputregleta28").value = "";
}
function desactivarCSS() {
    for ( i=0; i<document.styleSheets.length; i++) {
        void(document.styleSheets.item(i).disabled=true);
    }
}
function ayuda() {
    alert(
     "Линейка — это инструмент, с помощью которого можно легко выгравировать шрифт Брайля ЛАТЫНЬ ТОЛЬКО, [см. символы в Таблице, линк в самом низу страницы] на толстом листе бумаги,"+
     "Это своего рода руководство, позволяющее создавать хорошо выровненный рельеф ударом, не ломая"+
     "бумага. Деталь в том, что рельеф создается при нажатии пуансона из "+
     "обратная сторона листа, то есть вы пишете шрифтом Брайля на листе вверх ногами (справа" +
     "влево), чтобы его можно было нормально прочитать при переворачивании листа" +
     "(слева направо). Запутались? Возьмите листок бумаги, который у вас есть под рукой, и ручкой проткните "+
     "отверстия, соответствующие слову 'привет' шрифтом Брайля, когда закончите, переверните бумагу и прочитайте.\n"+
     "В любом случае, чтобы писать шрифтом Брайля с помощью линейки, вы должны записывать точки СПРАВА НАЛЕВО, вдобавок к этому"+
     "порядок точек следующий:\n\t\t4 1\n\t\t5 2\n\t\t6 3\n"+
     "Сначала вам будет трудно сделать инверсию, но потом это будет так же просто, как читать шрифт Брайля.\n"
    );
};

// Нажатие ввода после ввода в поле ввода запускает «отправить()».
document.addEventListener("keyup", function(event) {
    if (event.key === 'Enter') {
        enviar();
    }
});

limpiar();